import React, { useState } from "react";
import { ChevronDown, ChevronUp } from "lucide-react";

export default function Paragraph() {
  const [isHidden, setIsHidden] = useState(true);

  const toggleHidden = () => setIsHidden((prev) => !prev);

  return (
    <div className=" bg-gray-100">
      <div className="container mx-auto p-4 mt-12">
        <h3 className="text-md font-semibold mb-4">
          فروش و خرید ارز دیجیتال در صرافی ارز دیجیتال نوبیتکس
        </h3>

        <p
          className={`overflow-hidden transition-all duration-300 text-[14px] ${
            isHidden ? "line-clamp-3 " : ""
          } text-gray-400 leading-relaxed mb-4`}
        >
          خرید ارز دیجیتال در حال حاضر یکی از محبوب‌ترین راه‌های کسب سود است.
          بازار ارز دیجیتال برای سرمایه‌گذاری روی انواع دارایی‌های دیجیتال
          پتانسیل بالایی دارد. شما می‌توانید با خرید رمزارز و نگهداری آن سود
          کنید یا با معامله مداوم ارزهای دیجیتال تعداد رمزارزهای خود را افزایش
          دهید.<br /> صرافی ارز دیجیتال نوبیتکس به عنوان بزرگترین صرافی ارز دیجیتال
          بستر امنی برای کاربران ارز دیجیتال است. شما می‌توانید به سادگی در
          صرافی نوبیتکس ثبت نام کنید، ارز دیجیتال مورد علاقه خود را بخرید و در
          آدرس کیف پول اختصاصی نوبیتکس نگهداری کنید. علاوه بر این هر زمان که
          بخواهید، می‌توانید ارز دیجیتال مورد نظر را فروخته و به صورت ریال از
          حساب کاربری نوبیتکس خود برداشت کنید.<br /> در نوبیتکس شما با اولین معامله در
          بازار ارز دیجیتال تنها 5 دقیقه زمان و 50 هزار تومان سرمایه فاصله
          دارید. در این صرافی فرایند خرید و فروش ارز دیجیتال تا حد ممکن ساده شده
          و تنها با یک شماره تلفن همراه و یک کلیک در دسترس تمامی کاربران قرار
          دارد. شما می‌توانید با صرف کمترین زمان و همچنین کمترین سرمایه ممکن، به
          .دنیای شگفت انگیز ارز دیجیتال وارد شده و از تمامی فرصت‌ها استفاده کنید.<br />
          <strong className="text-gray-700">صرافی ارز دیجیتال</strong>
          <br /> صرافی ارز دیجیتال نوبیتکس با بیش از 10 میلیون کاربر
          و 6 سال سابقه فعالیت، بهترین صرافی ارز دیجیتال است که می‌توانید برای
          انواع خدمات روی آن حساب کنید. برای خرید ارز دیجیتال پیش از هر چیز به
          یک صرافی مطمئن نیاز دارید و نوبیتکس با پشتیبانی همه‌روزه و 24 ساعته،
          امن‌ترین صرافی ارز دیجیتال است که می‌توانید به آن اعتماد کنید. در
          نوبیتکس شما تنها 5 دقیقه با اولین معامله ارز دیجیتال فاصله دارید.
          علاوه بر این می‌توانید خرید نزدیک به 100 ارز محبوب را تنها با مبلغ 50
          هزار تومن آغاز کنید. ویژگی ها و مزایای صرافی امن و مطمئن ارز دیجیتال
          نوبیتکس صرافی ارز دیجیتال نوبیتکس به عنوان امن‌ترین و بزرگترین صرافی
          ایرانی مجموعه‌ای از بهترین و به‌روزترین امکانات را برای کاربران فراهم
          کرده است که در ادامه به گوشه‌ای از این امکانات اشاره خواهیم کرد:
          مشاهده قیمت لحظه ای ارز دیجیتال آخرین قیمت ارز دیجیتال را در صرافی
          نوبیتکس دنبال کنید. شما می‌توانید با استفاده نسخه اپلیکیشن یا وبسایت
          نوبیتکس به راحتیِ نگاه کردن به ساعت، قیمت بیت کوین را چک کنید یا با
          تنظیم هشدارهای قیمتی از تحرکات بزرگ و تعیین‌کننده بازار جا نمانید.
          علاوه بر این با نمودارهای به‌روز سایت نوبیتکس شما می‌توانید در لحظه از
          حرکت قیمتیِ انواع ارز دیجیتال مطلع شده و حرکت‌های بعدی بازار را تحلیل
          کنید. معامله انواع ارزهای دیجیتال در نوبیتکس شما می‌توانید نزدیک به
          100 ارز دیجیتال را در دو بازار تتری و ریالی معامله کنید. ارزهای
          دیجیتال محبوب بازار مانند بیت کوین، تتر، شیبا، دوج کوین، بی بی دوج،
          کاردانو، ریپل، اتریوم کلاسیک، پولکادات و… همه در بازار نوبیتکس لیست
          شده و شما می‌توانید به راحتی به خرید و فروش آن‌ها بپردازید. بهترین
          سایت فروش و خرید بیت کوین، تتر، اتریوم و سایر ارزهای دیجیتال حتی اگر
          تازه‌وارد هم باشید به طور قطع نام بیت کوین و تتر را شنیده‌اید. بیت
          کوین پادشاه ارزهای دیجیتال است و می‌توان گفت که بازار ارز دیجیتال بر
          محور این ارز استوار است. پس خرید بیت کوین به طور قطع یکی از اولین
          اقدامات هر معامله‌گری در ابتدای ورود به بازار ارز دیجیتال است. از طرفی
          دیگر تتر تنها نقش یک ارز دیجیتال را ایفا نمی‌کند. تتر ارزشی برابر با
          یک دلار دارد و می‌تواند علاوه بر ذخیره پول با ارزش ثابت یک دلار، برای
          معامله ارزهای دیجیتال در نوبیتکس نیز مورد استفاده قرار بگیرد. عده
          بسیاری خرید تتر را به منزله خرید دلار می‌دانند. بازار تتری یکی از
          بازارهای پر مخاطب نوبیتکس است و شما می‌توانید در این بازار با قیمت
          جهانی در بازار ارز دیجیتال معامله کنید. با توجه به حجم بالای معاملات
          نوبیتکس، مخصوصا در این دو بازار پرطرفدار، نوبیتکس بهترین صرافی ارز
          دیجیتال برای نگهداری و خرید بیت کوین و تتر است. چراکه سفارشات شما در
          سریع‌ترین زمان ممکن با سفارش دیگری هماهنگ شده و کامل می‌شود. مهم‌ترین
          ابزارهای حرفه‌ای در بازار نوبیتکس یک معامله حرفه‌ای به ابزارهای
          حرفه‌ای برای موفقیت نیاز دارد. صرافی رمزارز نوبیتکس حرفه‌ای‌ترین و
          به‌روزترین ابزارها را در بازار ارز دیجیتال دنیا در اختیار شما قرار
          می‌دهد. در ادامه با بخشی از این خدمات آشنا می‌شویم. تنوع سفارش‌گذاری
          مرسوم‌ترین سفارش‌ها در بازار ارز دیجیتال، سفارش سریع و سفارش معین است.
          در سفارش سریع شما می‌توانید با قیمت بازار خرید و فروش ارز دیجیتال را
          تجربه کنید؛ اما در سفارش معین شما می‌توانید هر قیمتی را که دوست دارید
          برای خرید و فروش ارز دیجیتال مورد نظر خود انتخاب کنید. تفاوت اینجاست
          که در سفارش سریع، معامله شما به طور قطع در سریع‌ترین زمان ممکن انجام
          می‌شود؛ اما در سفارش معین، هیچ تضمینی برای کامل شدن سفارش شما نیست. در
          نوبیتکس شما می‌توانید با استفاده از سفارش‌های حرفه‌ای‌تری مانند حد ضرر
          و OCO، موفقیت و کاهش ریسک معامله را تا حد ممکن تضمین کنید. بازارهای دو
          طرفه اگر روند بیت کوین و سایر دارایی‌های ارز دیجیتال نزولی باشد چه
          باید کرد؟ آیا کسی می‌تواند در بازار نزولی هم سود کند؟ شما می‌توانید در
          صرافی رمزارز نوبیتکس چه از روند صعودی بازار و چه حتی از روند نزولی کسب
          درآمد کنید. معاملات تعهدی نوبیتکس قابلیت کسب سود از روند نزولی با ضریب
          و همچنین استفاده از ضریب برای روند صعودی را نیز فراهم کرده است.
          استیکینگ استیکینگ یکی از خدمات صرافی نوبیتکس است که به کسب درآمد منفعل
          منجر می‌شود. درآمد منفعل شکلی از درآمد است که با کمترین ریسک ممکن،
          درآمد نسبتا مطمئنی را فراهم می‌کند. استیکینگ فرآیندی است که شما
          می‌توانید با قفل کردن دارایی خود در شبکه اثبات سهام یک ارز، به تایید
          تراکنش‌های آن شبکه کمک کنید. این عمل از سوی شبکه پاداش خواهد داشت و
          پاداش شما به ازای ارزی که قفل کرده‌اید، بعد از اتمام مدت استیکینگ به
          حساب شما واریز می‌شود. ییلد فارمینگ ییلد فارمینگ یکی دیگر از راه‌های
          کسب درآمد منفعل یا دریافت پاداش از قفل کردن دارایی رمزارزهاست. در این
          روش شما با در اختیار قرار دادن دارایی خود در شبکه‌های غیرمتمرکز پاداش
          به دست می‌آورید. از دارایی قفل شده شما ممکن است برای اهداف مختلفی در
          امور مالی غیرمتمرکز استفاده شود. به عنوان مثال وام‌دهی و تامین نقدینگی
          از جمله این استفاده‌ها هستند. استخر مشارکت استخر مشارکت یکی دیگر از
          روش‌هایی است که در صرافی نوبیتکس برای کسب درآمد منفعل پدید آورده
          شده‌است. در این روش شما با قفل کردن دارایی خود نزد نوبیتکس، به تامین
          نقدینگی فروش تعهدی نوبیتکس کمک می‌کنید و در ازای آن، پاداش دریافت
          می‌کنید. خرید و فروش تعهدی معامله تعهدی یکی از امکانات صرافی نوبیتکس
          است که به معامله‌گران کمک می‌کنند بر اساس تحلیل‌های خود درصد سود خود
          را افزایش بدهند. علاوه بر این شما در فروش تعهدی می‌توانید از حرکات
          نزولی بازار نیز کسب سود کنید. این امکان نوبیتکس آن را به پلتفرمی جذاب
          برای معامله‌گران بدل کرده است. اپلیکیشن خرید و فروش ارز دیجیتال
          نوبیتکس بازار ارز دیجیتال یک بازار شبانه‌روزی است و برای فعالیت هرچه
          موثرتر در این بازار نوبیتکس با اپلیکیشن خرید ارز دیجیتال سریع‌ترین و
          ساده‌ترین شکل دسترسی را مهیا کرده است. اپلیکیشن صرافی ارز دیجیتال
          نوبیتکس یک اپلیکیشن کاربردی با پشتیبانی شبانه‌روزی است که می‌تواند در
          کوتاه‌ترین زمان ممکن شما را به بازار رمزارزها متصل کند. شما می‌توانید
          با نسخه اپلیکیشن صرافی نوبیتکس تقریبا به تمامی امکاناتی که در سایت
          اصلی از آنها برخوردار هستید، دسترسی داشته باشید. خرید و فروش ارز
          دیجیتال، مشاهده قیمت لحظه ای ارز دیجیتال، مشاهده نمودارها، کیف پول
          شخصی، واریز و برداشت و… همه از جمله امکاناتی هستند که شما تنها در یک
          اپلیکیشن ساده می‌توانید به آن دسترسی داشته باشید. معامله آسان، سریع و
          بدون محدودیت در صرافی نوبیتکس به واسطه طراحی کاربر پسند، شروع به
          معامله بسیار آسان است. همانطور که گفتیم شما می‌توانید تنها در 5 دقیقه
          معامله ارز دیجیتال را شروع کنید و از انواع ابزارهای حرفه‌ای بهره
          بگیرید. واریز و برداشت‌ سریع واریز و برداشت سریع یکی از خدمات برجسته
          صرافی ارز دیجیتال نوبیتکس است که به کاربران این پلتفرم امکان انجام
          تراکنش‌ با سرعت و کارایی بالا را ارائه می‌دهد. با بهره‌گیری از
          فناوری‌های پیشرفته، واریز و برداشت از حساب‌های نوبیتکس به سرعت و به
          صورت آنی انجام می‌شود، این امر به کاربران بازار کریپتو این اطمینان را
          می‌دهد که تراکنش‌های مالی خود را به سرعت و بدون درنگ انجام داده و از
          امکانات مدیریت حساب خود به بهترین شکل بهره‌مند شوند. معامله با پایین
          ترین کارمزد یکی از مهم‌ترین پارامترها برای انتخاب صرافی رمز ارز، پایین
          بودن کارمزد آن است. در صرافی نوبیتکس، شما می‌توانید با پایین‌ترین
          کارمزد ممکن، به خرید و فروش ارزهای دیجیتال بپردازید. این کارمزد پایین
          نه تنها به شما کمک می‌کند تا سود بیشتری کسب کنید، بلکه امکان دسترسی به
          بازارهای مختلف را برای شما فراهم می‌آورد و هزینه‌های اضافی کمتری را
          پرداخت خواهید کرد. پشتیبانی 24 ساعته و 7 روز هفته نوبیتکس با پشتیبانی
          شبانه‌روزی در تمامی روزهای هفته در تلاش است تا بهترین خدمات ممکن را
          برای شما فراهم کند. پشتیبانی نوبیتکس در هر ساعتی از شبانه‌روز برای
          پاسخگویی به مشکلات و سوالات شما حاضر است. بنابراین شما می‌توانید با
          خیالی آسوده و بدون نگرانی در هر ساعتی از شبانه‌روز معامله کنید. احراز
          هویت آنلاین و سریع زیر 5 دقیقه برای احراز هویت آنلاین سریع و مطمئن در
          صرافی ارز دیجیتال نوبیتکس، می‌توانید در کمتر از 5 دقیقه به راحتی هویت
          خود را تأیید کنید. شما می‌توانید به صورت فوری و بدون دردسر، احراز هویت
          خود را تکمیل کرده و بلافاصله از تمامی امکانات و مزایای ارائه شده توسط
          پلتفرم نوبیتکس بهره‌مند شوید. همچنین نوبیتکس با بهره‌گیری از
          فناوری‌های پیشرفته و حفاظت از اطلاعات شخصی، ایمنی و محرمانگی اطلاعات
          شما را تضمین می‌کند تا بتوانید تجربه‌ای بی‌نظیر را در این پلتفرم تجربه
          کنید. امنیت بالای نوبیتکس حفظ امنیت سرمایه شما در نوبیتکس اولویت و
          ارزش اصلی ماست. در صرافی رمزارز نوبیتکس سطح امنیتی دارایی و حساب
          کاربری شما در بالاترین حد خود قرار دارد. نوبیتکس با استفاده از انواع
          روش‌های موجود و همچنین خلق روش‌های نوین به صورت شبانه‌روزی در تلاش است
          تا امنیت دارایی شما را تضمین کند. استفاده از ذخیره‌سازی سرد دارایی‌ها،
          رمز دوعاملی، سیستم برداشت چندامضایی و… تنها بخشی از راهکارهای امنیتی
          اعمال شده در صرافی نوبیتکس است. نوبیتکس بزرگترین صرافی ارز دیجیتال
          ایران تا به امروز بیش از 9 میلیون نفر به نوبیتکس اعتماد کرده‌اند.
          نوبیتکس با 6 سال سابقه فعالیت به عنوان صرافی ارز دیجیتال، یکی از
          قدیمی‌ترین و البته بزرگترین صرافی‌ ارز دیجیتال ایرانی است. حجم بالای
          سفارشات، منجر به کامل شدن هر چه سریع‌تر سفارش شما می‌شود و شما
          می‌توانید در نوبیتکس با کمترین شکاف قیمتی با بازارهای جهانی، معامله را
          شروع کنید. خرید و فروش ارز دیجیتال، مشاهده قیمت لحظه‌ ای ارز دیجیتال،
          استفاده از هشدارهای قیمتی، واریز و برداشت ارز دیجیتال، پشتیبانی 24
          ساعته، ذخیره‌سازی امن، آدرس اختصاصی کیف پول، نسخه اپلیکیشن و… تنها
          بخشی از خدمات نوبیتکس به عنوان بزرگترین و بهترین صرافی رمزارز ایران
          است.
        </p>

        <button
        onClick={toggleHidden}
        className="w-full flex items-center justify-center text-purple-500 cursor-pointer focus:outline-none"
      >
        {isHidden ? <ChevronDown size={24} /> : <ChevronUp size={24} />}
      </button>
      </div>
    </div>
  );
}
